benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-cal-72335.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  702.86us   6.12ms   70.83%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.16ms
 75.000%    1.69ms
 90.000%    2.36ms
 99.000%    3.19ms
 99.900%    4.15ms
 99.990%    5.08ms
 99.999%    5.72ms
100.000%    6.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.027     0.000000            1         1.00
       0.547     0.100000        65393         1.11
       0.720     0.200000       130525         1.25
       0.858     0.300000       195309         1.43
       1.001     0.400000       260553         1.67
       1.165     0.500000       325508         2.00
       1.257     0.550000       357995         2.22
       1.352     0.600000       390744         2.50
       1.450     0.650000       423135         2.86
       1.560     0.700000       455760         3.33
       1.689     0.750000       488132         4.00
       1.765     0.775000       504433         4.44
       1.853     0.800000       520669         5.00
       1.952     0.825000       536942         5.71
       2.065     0.850000       553513         6.67
       2.191     0.875000       569491         8.00
       2.271     0.887500       577702         8.89
       2.363     0.900000       585821        10.00
       2.461     0.912500       593930        11.43
       2.569     0.925000       602168        13.33
       2.671     0.937500       610265        16.00
       2.719     0.943750       614383        17.78
       2.767     0.950000       618324        20.00
       2.817     0.956250       622380        22.86
       2.869     0.962500       626559        26.67
       2.921     0.968750       630520        32.00
       2.949     0.971875       632605        35.56
       2.979     0.975000       634589        40.00
       3.013     0.978125       636686        45.71
       3.051     0.981250       638703        53.33
       3.091     0.984375       640694        64.00
       3.115     0.985938       641691        71.11
       3.141     0.987500       642714        80.00
       3.171     0.989062       643744        91.43
       3.205     0.990625       644751       106.67
       3.245     0.992188       645776       128.00
       3.265     0.992969       646260       142.22
       3.291     0.993750       646788       160.00
       3.321     0.994531       647274       182.86
       3.365     0.995313       647795       213.33
       3.429     0.996094       648290       256.00
       3.469     0.996484       648546       284.44
       3.521     0.996875       648799       320.00
       3.599     0.997266       649052       365.71
       3.681     0.997656       649307       426.67
       3.783     0.998047       649561       512.00
       3.847     0.998242       649687       568.89
       3.913     0.998437       649817       640.00
       3.969     0.998633       649942       731.43
       4.063     0.998828       650069       853.33
       4.167     0.999023       650200      1024.00
       4.211     0.999121       650261      1137.78
       4.267     0.999219       650325      1280.00
       4.327     0.999316       650389      1462.86
       4.419     0.999414       650454      1706.67
       4.491     0.999512       650515      2048.00
       4.531     0.999561       650546      2275.56
       4.583     0.999609       650577      2560.00
       4.631     0.999658       650609      2925.71
       4.695     0.999707       650641      3413.33
       4.759     0.999756       650675      4096.00
       4.791     0.999780       650688      4551.11
       4.839     0.999805       650704      5120.00
       4.891     0.999829       650721      5851.43
       4.951     0.999854       650736      6826.67
       4.991     0.999878       650752      8192.00
       5.023     0.999890       650760      9102.22
       5.087     0.999902       650768     10240.00
       5.143     0.999915       650776     11702.86
       5.175     0.999927       650784     13653.33
       5.203     0.999939       650793     16384.00
       5.219     0.999945       650796     18204.44
       5.275     0.999951       650800     20480.00
       5.319     0.999957       650804     23405.71
       5.347     0.999963       650808     27306.67
       5.383     0.999969       650812     32768.00
       5.403     0.999973       650814     36408.89
       5.467     0.999976       650816     40960.00
       5.535     0.999979       650818     46811.43
       5.619     0.999982       650820     54613.33
       5.675     0.999985       650822     65536.00
       5.707     0.999986       650823     72817.78
       5.719     0.999988       650824     81920.00
       5.763     0.999989       650826     93622.86
       5.763     0.999991       650826    109226.67
       5.891     0.999992       650827    131072.00
       5.891     0.999993       650827    145635.56
       5.927     0.999994       650828    163840.00
       5.927     0.999995       650828    187245.71
       5.971     0.999995       650829    218453.33
       5.971     0.999996       650829    262144.00
       5.971     0.999997       650829    291271.11
       5.987     0.999997       650830    327680.00
       5.987     0.999997       650830    374491.43
       5.987     0.999998       650830    436906.67
       5.987     0.999998       650830    524288.00
       5.987     0.999998       650830    582542.22
       6.127     0.999998       650831    655360.00
       6.127     1.000000       650831          inf
#[Mean    =        1.314, StdDeviation   =        0.703]
#[Max     =        6.124, Total count    =       650831]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  650845 requests in 10.00s, 72.62MB read
Requests/sec:  65083.20
Transfer/sec:      7.26MB