benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-peakfind.txt
Running 15s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 4985.822ms, rate sampling interval: 18169ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.39s     1.35s   14.88s    57.73%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.37s
 75.000%   13.56s
 90.000%   14.26s
 99.000%   14.71s
 99.900%   14.84s
 99.990%   14.87s
 99.999%   14.88s
100.000%   14.88s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9945.087     0.000000           15         1.00
   10543.103     0.100000        35529         1.11
   10993.663     0.200000        70251         1.25
   11444.223     0.300000       105452         1.43
   11902.975     0.400000       140571         1.67
   12369.919     0.500000       175273         2.00
   12607.487     0.550000       192757         2.22
   12845.055     0.600000       210188         2.50
   13082.623     0.650000       227631         2.86
   13328.383     0.700000       245696         3.33
   13557.759     0.750000       262718         4.00
   13680.639     0.775000       271840         4.44
   13795.327     0.800000       280293         5.00
   13918.207     0.825000       289340         5.71
   14032.895     0.850000       297895         6.67
   14147.583     0.875000       306608         8.00
   14204.927     0.887500       311019         8.89
   14262.271     0.900000       315377        10.00
   14319.615     0.912500       319698        11.43
   14376.959     0.925000       323973        13.33
   14442.495     0.937500       328843        16.00
   14467.071     0.943750       330675        17.78
   14499.839     0.950000       333131        20.00
   14524.415     0.956250       334962        22.86
   14557.183     0.962500       337408        26.67
   14581.759     0.968750       339221        32.00
   14598.143     0.971875       340391        35.56
   14614.527     0.975000       341480        40.00
   14630.911     0.978125       342517        45.71
   14655.487     0.981250       343930        53.33
   14671.871     0.984375       344799        64.00
   14688.255     0.985938       345609        71.11
   14696.447     0.987500       345984        80.00
   14704.639     0.989062       346349        91.43
   14721.023     0.990625       347025       106.67
   14737.407     0.992188       347645       128.00
   14745.599     0.992969       347919       142.22
   14753.791     0.993750       348183       160.00
   14761.983     0.994531       348424       182.86
   14770.175     0.995313       348655       213.33
   14778.367     0.996094       348862       256.00
   14786.559     0.996484       349057       284.44
   14794.751     0.996875       349237       320.00
   14794.751     0.997266       349237       365.71
   14802.943     0.997656       349398       426.67
   14811.135     0.998047       349543       512.00
   14819.327     0.998242       349680       568.89
   14819.327     0.998437       349680       640.00
   14827.519     0.998633       349798       731.43
   14827.519     0.998828       349798       853.33
   14835.711     0.999023       349901      1024.00
   14835.711     0.999121       349901      1137.78
   14835.711     0.999219       349901      1280.00
   14843.903     0.999316       349983      1462.86
   14843.903     0.999414       349983      1706.67
   14852.095     0.999512       350054      2048.00
   14852.095     0.999561       350054      2275.56
   14852.095     0.999609       350054      2560.00
   14852.095     0.999658       350054      2925.71
   14860.287     0.999707       350108      3413.33
   14860.287     0.999756       350108      4096.00
   14860.287     0.999780       350108      4551.11
   14860.287     0.999805       350108      5120.00
   14860.287     0.999829       350108      5851.43
   14860.287     0.999854       350108      6826.67
   14868.479     0.999878       350143      8192.00
   14868.479     0.999890       350143      9102.22
   14868.479     0.999902       350143     10240.00
   14868.479     0.999915       350143     11702.86
   14868.479     0.999927       350143     13653.33
   14868.479     0.999939       350143     16384.00
   14868.479     0.999945       350143     18204.44
   14868.479     0.999951       350143     20480.00
   14876.671     0.999957       350158     23405.71
   14876.671     0.999963       350158     27306.67
   14876.671     0.999969       350158     32768.00
   14876.671     0.999973       350158     36408.89
   14876.671     0.999976       350158     40960.00
   14876.671     0.999979       350158     46811.43
   14876.671     0.999982       350158     54613.33
   14876.671     0.999985       350158     65536.00
   14876.671     0.999986       350158     72817.78
   14876.671     0.999988       350158     81920.00
   14876.671     0.999989       350158     93622.86
   14876.671     0.999991       350158    109226.67
   14876.671     0.999992       350158    131072.00
   14876.671     0.999993       350158    145635.56
   14876.671     0.999994       350158    163840.00
   14876.671     0.999995       350158    187245.71
   14876.671     0.999995       350158    218453.33
   14876.671     0.999996       350158    262144.00
   14876.671     0.999997       350158    291271.11
   14876.671     0.999997       350158    327680.00
   14884.863     0.999997       350159    374491.43
   14884.863     1.000000       350159          inf
#[Mean    =    12385.463, StdDeviation   =     1348.548]
#[Max     =    14876.672, Total count    =       350159]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1134685 requests in 15.00s, 126.61MB read
Requests/sec:  75645.60
Transfer/sec:      8.44MB